**Задача 1**

Напишите функцию `filter_above(numbers, min_value=5)`, которая отфильтрует список, оставив в нем только значения больше указанного `min_value`

Пример работы программы:

```python
filter_above([2,4,6,8,10], min_value=5) >> [6,8,10]

filter_above([2,4,6,8,10], min_value=0) >> [2,4,6,8,10]

filter_above([2,4,6,8,10], min_value=10) >> []

```

**Задача 2**

Напишите функцию `fit_in_boxes(numbers, slots=2)`, которая разложит список чисел по спискам или кортежам так, чтобы в каждом было `slots` элементов.

Пример работы программы:

```python
fit_in_boxes([1,2,3,4,5,6,7,8]) >> [[1,2], [3,4], [5,6], [7,8]]

fit_in_boxes([1,2,3,4,5,6,7,8], 4) >> [[1,2,3,4], [5,6,7,8]]

fit_in_boxes([1,2,3,4,5,6,7,8], 3) >> [[1,2,3], [4,5,6], [7,8]]
```

**Задача 3**

Стандартная рабочая смена сотрудника длится 6 часов.  Напишите функцию `count_shifts_by_hours(hours, shift=6)` которая возвращает сколько рабочих дней понадобится на выполнение работы. Результат округлите в большую сторону до полных дней.

Пример работы программы:

```python
count_shifts_by_hours(12) >> 2

count_shifts_by_hours(1) >> 1

count_shifts_by_hours(12, 4) >> 3

count_shifts_by_hours(1, 4) >> 1
```

**Задача 4**

Напишите функцию `get_list_top(elements, limit=3)` которая получает список элементов, сортирует их по убыванию и возвращает первые `limit` элементов. 

Пример работы программы:

```python
get_list_top(["B", "D", "A", "X", "M"]) >>  ["X","M","D"]

get_list_top(["B", "D", "A", "X", "M"], limit=2) >>  ["X","M"]

get_list_top(["B", "D", "A", "X", "M"], limit=4) >>  ["X","M","D","B"]

get_list_top([10,8,6,4,2]) >>  [10, 8, 6]
```

**Задача 5**

Напишите функцию `check_baggage_size(x, y, z, limit=100)` ,  которая получает размер багажа по длине, ширине и высоте и проверяет, не превышает ли сумма `limit` и возвращает `True`  если багаж не превышает лимита и  `False` если превышает. 

Пример работы программы:

```python
check_baggage_size(40, 40, 20) >> True
check_baggage_size(40, 40, 40) >> False

check_baggage_size(40, 40, 20, limit=60) >> False
check_baggage_size(40, 40, 40, limit=200) >> True
```

**Задача 6**

Напишите функцию `sum_args(…)`, которая принимает любое количество аргументов и возвращает их сумму. Используйте `*args` для запаковки аргументов.

Пример работы программы:

```python
sum_args(2,4,6) >> 12
```

**Задача 7**

Напишите функцию `count_kwargs(...)`, которая принимает любое количество **именованных** аргументов и возвращает их количество. Используйте `**kwargs` для распаковки аргументов.

Пример работы программы:

```python
count_kwargs(1,2,3,4,5) >> 5
```

**Задача 8**

Напишите функцию `get_average(…)`, которая принимает в виде аргументов числа в любом количестве  и возвращает их среднее арифметическое:

Пример работы программы:

```python
get_average(2,4,6) >> 4
```

**Задача 9**

Напишите функцию, которая принимает любое количество аргументов и возвращает список, содержащий только уникальные значения (порядок не важен). Используйте *args для запаковки аргументов.

Пример работы программы:

```python
unicalize(2,2,4,6,6) >> [2,4,6]
```

**Задача 10**

Напишите функцию, которая принимает список строк и возвращает самую длинную строку. Используйте `*args` для запаковки аргументов.

Пример работы программы:

```python
longest_string("one", "three", "five") >> "three"
```

Для выполнения следующих заданий вам понадобится исходный код. Скопируйте его себе перед выполнением задания и передавайте в каждую функцию.

```python
products = [
    { "icon": "🍏", "name": "Аpple", "cat": "fruit","price": 100 },
    { "icon": "🍎","name": "Apple","cat": "fruit","price": 120 },
    { "icon": "🍌", "name": "Banana", "cat": "fruit", "price": 90 },
    { "icon": "🥑", "name": "Avocado", "cat": "fruit", "price": 200 },
    { "icon": "🍅", "name": "Tomato", "cat": "veggie", "price": 100 },
    { "icon": "🥦", "name": "Broccoli", "cat": "veggie", "price": 300 },
    { "icon": "🥕", "name": "Carrot", "cat": "veggie", "price": 100 },
    { "icon": "🍪",  "name": "Cookie", "cat": "sweets", "price": 200 },
    { "icon": "🍩", "name": "Donut", "cat": "sweets",  "price": 300 },
    { "icon": "🍰", "name": "Cake", "cat": "sweets",  "price": 400 },
]
```

**Задача 11**

Напишите функцию `extract_names(products)`, которая получит названия всех фруктов в виде плоского списка

Пример работы программы:

```python
extract_names(products) >> ["Apple", "Apple", "Banana", ...]
```

**Задача 12**

Напишите функцию `extract_names_by_cat(products, category)`, которая вернет названия всех фруктов из категории в виде плоского списка

Пример работы программы:

```python
extract_names(products, "sweets") >> ["Cookie", "Donut", "Cake"]
```

**Задача 13**

Напишите функцию `sum_all_products(products)` которая вернет сумму по ключу `price` всех переданных products

Пример работы программы:

```python
sum_all_products(products[:2]) >> 220
```

**Задача 14**

Напишите функцию `sum_products_by_cat(products, category)` которая вернет сумму всех продуктов по категории `category`

Пример работы программы:

```python
sum_products_by_cat(products, "sweets") >> 900
```

**Задача 15**

Напишите функцию `get_products_by_price(products, price_from, price_to)` которая вернет все продукты , у которых цена находится заданном интервале от `price_from` до `price_to` включительно.

Пример работы программы:
get_products_by_price(products, 0, 100) >>

[
	{ "icon": "🍏", "name": "Аpple", "cat": "fruit","price": 100 },
	{ "icon": "🍌", "name": "Banana", "cat": "fruit", "price": 90 },
	{ "icon": "🍅", "name": "Tomato", "cat": "veggie", "price": 100 },
	{ "icon": "🥕", "name": "Carrot", "cat": "veggie", "price": 100 },
]
